app/controllers/songs_controller.rb

  def index

    if params[:artist_id]
  		@artist = Artist.find_by(id: params[:artist_id])
  		@artist ? @songs = @artist.songs : redirect_to artists_path, alert: "Artist not found"
  	else
  		@songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]